{
  "columns": ["Climax"],
  "entries": [{
    "Roll": 1.0,
    "weight": 1.0,
    "Climax": "The adventurers confront the main villain and a group of minions in a bloody battle to the finish."
  }, {
    "Roll": 2.0,
    "weight": 1.0,
    "Climax": "The adventurers chase the villain while dodging obstacles designed to thwart them, leading to a final confrontation in or outside the villain's refuge."
  }, {
    "Roll": 3.0,
    "weight": 1.0,
    "Climax": "The actions of the adventurers or the villain result in a cataclysmic event that the adventurers must escape."
  }, {
    "Roll": 4.0,
    "weight": 1.0,
    "Climax": "The adventurers race to the site where the villain is bringing a master plan to its conclusion, arriving just as that plan is about to be completed."
  }, {
    "Roll": 5.0,
    "weight": 1.0,
    "Climax": "The villain and two or three lieutenants perform separate rites in a large room. The adventurers must disrupt all the rites at the same time."
  }, {
    "Roll": 6.0,
    "weight": 1.0,
    "Climax": "An ally betrays the adventurers as they're about to achieve their goal. (Use this climax carefully, and don't overuse it.)"
  }, {
    "Roll": 7.0,
    "weight": 1.0,
    "Climax": "A portal opens to another plane of existence. Creatures on the other side spill out, forcing the adventurers to close the portal and deal with the villain at the same time."
  }, {
    "Roll": 8.0,
    "weight": 1.0,
    "Climax": "Traps, hazards, or animated objects turn against the adventurers while the main villain attacks."
  }, {
    "Roll": 9.0,
    "weight": 1.0,
    "Climax": "The dungeon begins to collapse while the adventurers face the main villain, who attempts to escape in the chaos."
  }, {
    "Roll": 10.0,
    "weight": 1.0,
    "Climax": "A threat more powerful than the adventurers appears, destroys the main villain, and then turns its attention on the characters."
  }, {
    "Roll": 11.0,
    "weight": 1.0,
    "Climax": "The adventurers must choose whether to pursue the fleeing main villain or save an N PC they care about or a group of innocents."
  }, {
    "Roll": 12.0,
    "weight": 1.0,
    "Climax": "The adventurers must discover the main villain's secret weakness before they can hope to defeat that villain"
  }],
  "maxRoll": 12,
  "name": "Climaxes"
}
