{
  "columns": ["Background", "Skills", "Languages", "Tools Proficiencies", "Equipment"],
  "entries": [{
    "weight": 1,
    "roll": "1",
    "values": ["Acolyte", "Insight, Religion", "Two of choice", "-", "A holy symbol (a gift to you when you entered the priesthood), a prayer book or prayer wheel, 5 sticks of incense, vestments, a set of common clothes, and a belt pouch containing 15 gp."]
  }, {
    "weight": 1,
    "roll": "2",
    "values": ["Charlatan", "Deception, Sleight of Hand", "-", "Disguise kit, forgery kit", "A set of fine clothes, a disguise kit, tools of the con of your choice (ten stoppered bottles filled with colored liquid, a set of weighted dice, a deck of marked cards, or a signet ring of an imaginary duke), and a belt pouch containing 15 gp."]
  }, {
    "weight": 1,
    "roll": "3",
    "values": ["Criminal", "Deception, Stealth", "-", "One type of gaming set, thieves' tools", "A crowbar, a set of dark common clothes including a hood, and a belt pouch containing 15 gp."]
  }, {
    "weight": 1,
    "roll": "4",
    "values": ["Entertainer", "Acrobatics, Performance", "-", "Disguise kit, one type of musical instrument", "A musical instrument (one of your choice), the favor of an admirer (love letter, lock of hair, or trinket), a costume, and a belt pouch containing 15 gp."]
  }, {
    "weight": 1,
    "roll": "5",
    "values": ["Folk Hero", "Animal Handling, Survival", "-", "One type of artisan’s tools, vehicles (land)", "A set of artisan’s tools (one of your choice), a shovel, an iron pot, a set of common clothes, and a belt pouch containing 10 gp."]
  }, {
    "weight": 1,
    "roll": "6",
    "values": ["Guild Artisan", "Insight, Persuasion", "One of choice", "One type of artisan’s tools", "A set of artisan’s tools (one of your choice), a letter of introduction from your guild, a set of traveler’s clothes, and a belt pouch containing 15 gp."]
  }, {
    "weight": 1,
    "roll": "7",
    "values": ["Hermit", "Medicine, Religion", "One of choice", "Herbalism kit", "A scroll case stuffed full of notes from your studies or prayers, a winter blanket, a set of common clothes, an herbalism kit, and 5 gp."]
  }, {
    "weight": 1,
    "roll": "8",
    "values": ["Noble", "History, Persuasion", "One of choice", "One type of gaming set", "A set of fine clothes, a signet ring, a scroll of pedigree, and a purse containing 25 gp."]
  }, {
    "weight": 1,
    "roll": "9",
    "values": ["Outlander", "Athletics, Survival", "One of choice", "One type of musical instrument", "A staff, a hunting trap, a trophy from an animal you killed, a set of traveler’s clothes, and a belt pouch containing 10 gp."]
  }, {
    "weight": 1,
    "roll": "10",
    "values": ["Sage", "Arcana, History", "Two of choice", "-", "A bottle of black ink, a quill, a small knife, a letter from a dead colleague posing a question you have not yet been able to answer, a set of common clothes, and a belt pouch containing 10 gp."]
  }, {
    "weight": 1,
    "roll": "11",
    "values": ["Sailor", "Athletics, Perception", "-", "Navigator’s tools, vehicles (water)", "A belaying pin (club), 50 feet of silk rope, a lucky charm such as a rabbit foot or a small stone with a hole in the center (or you may roll for a random trinket on the Trinkets table in chapter 5), a set of common clothes, and a belt pouch containing 10 gp."]
  }, {
    "weight": 1,
    "roll": "12",
    "values": ["Soldier", "Athletics, Intimidation", "-", "One type of gaming set, vehicles (land)", "An insignia of rank, a trophy taken from a fallen enemy (a dagger, broken blade, or piece of a banner), a set of bone dice or deck of cards, a set of common clothes, and a belt pouch containing 10 gp."]
  }, {
    "weight": 1,
    "roll": "13",
    "values": ["Urchin", "Sleight of Hand, Stealth", "-", "Disguise kit, thieves’ tools", "A small knife, a map of the city you grew up in, a pet mouse, a token to remember your parents by, a set of common clothes, and a belt pouch containing 10 gp."]
  }],
  "maxRoll": 13,
  "name": "Backgrounds"
}
